For what it's worth, I'm seeing the same issue. With Terraform 0.12.8 and AzureRM provider 1.33.1, no changes to code = no changes to AKS cluster.

As soon as I upgrade the AzureRM provider to 1.34, it wants to recreate the cluster.

Terraform code:

```
resource "azurerm_kubernetes_cluster" "primary" {
  name                = "REDACTED"
  resource_group_name = azurerm_resource_group.services.name
  location            = var.primary_cluster_location
  dns_prefix          = "REDACTED"

  agent_pool_profile {
    name            = "default"
    count           = "2"
    vm_size         = "Standard_A2_v2"
    os_type         = "Linux"
    os_disk_size_gb = 30
  }

  linux_profile {
    admin_username = "REDACTED"

    ssh_key {
      key_data = var.cluster_admin_ssh_key
    }
  }

  service_principal {
    client_id     = var.cluster_application
    client_secret = var.cluster_service_principal_password
  }
}
```

Oddly, like @dominik-lekse, there's nothing listed in Terraform's output to hint as to which field triggered the requirement to recreate:

```
  # module.services.azurerm_kubernetes_cluster.primary must be replaced
-/+ resource "azurerm_kubernetes_cluster" "primary" {
      - api_server_authorized_ip_ranges = [] -> null
        dns_prefix                      = "REDACTED"
      ~ enable_pod_security_policy      = false -> (known after apply)
      ~ fqdn                            = "REDACTED" -> (known after apply)
      ~ id                              = "/subscriptions/REDACTED/resourcegroups/REDACTED/providers/Microsoft.ContainerService/managedClusters/REDACTED" -> (known after apply)
      ~ kube_admin_config               = [] -> (known after apply)
      + kube_admin_config_raw           = (sensitive value)
      ~ kube_config                     = [
          - {
              - client_certificate     = "REDACTED"
              - client_key             = "REDACTED"
              - cluster_ca_certificate = "REDACTED"
              - host                   = "https://REDACTED.azmk8s.io:443"
              - password               = "REDACTED"
              - username               = "clusterUser_REDACTED"
            },
        ] -> (known after apply)
      ~ kube_config_raw                 = (sensitive value)
      ~ kubernetes_version              = "1.11.2" -> (known after apply)
        location                        = "southeastasia"
        name                            = "REDACTED"
      ~ node_resource_group             = "MC_REDACTED" -> (known after apply)
        resource_group_name             = "REDACTED"
      ~ tags                            = {} -> (known after apply)
      ~ addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }
          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }
          + kube_dashboard {
              + enabled = (known after apply)
            }
          ~ oms_agent {
              ~ enabled                    = false -> (known after apply)
              + log_analytics_workspace_id = (known after apply)
            }
        }
      ~ agent_pool_profile {
          - availability_zones  = [] -> null
            count               = 2
          + dns_prefix          = (known after apply)
          - enable_auto_scaling = false -> null
          ~ fqdn                = "REDACTED.azmk8s.io" -> (known after apply)
          - max_count           = 0 -> null
          ~ max_pods            = 110 -> (known after apply)
          - min_count           = 0 -> null
            name                = "default"
          - node_taints         = [] -> null
            os_disk_size_gb     = 30
            os_type             = "Linux"
            type                = "AvailabilitySet"
            vm_size             = "Standard_A2_v2"
        }
        linux_profile {
            admin_username = "REDACTED"
            ssh_key {
                key_data = "ssh-rsa REDACTED"
            }
        }
      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ load_balancer_sku  = "Basic" -> (known after apply)
          ~ network_plugin     = "kubenet" -> (known after apply)
          + network_policy     = (known after apply)
          ~ pod_cidr           = "10.244.0.0/16" -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)
        }
      ~ role_based_access_control {
          ~ enabled = false -> (known after apply)
          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }
      ~ service_principal {
            client_id     = "REDACTED"
          + client_secret = (sensitive value)
        }
    }
```